radareorg/radare2/libr/arch/p/tms320/tms320_dasm.c
/*
 * TMS320 disassembly engine
 *
 * Written by Ilya V. Matveychikov <i.matveychikov@milabs.ru>
 *
 * Distributed under LGPL
 */

#include <stdio.h>
#include <string.h>

/* public headers */
#include <r_util.h>
#include <r_types.h>
#include <sdb/sdb.h>

/* private headers */
#include "tms320_p.h"
#include "tms320_dasm.h"

#include "c55x_plus/c55plus.h"

/*
 * TMS320 disassembly engine implementation
 */

int run_f_list(tms320_dasm_t *dasm) {
	ut32 temp;
	insn_flag_t *flag;

	if (!dasm->insn->f_list) {
		return 1;
	}

	for (flag = dasm->insn->f_list; !f_list_last (flag); flag++) {
		switch (flag->v) {
		case TMS320_FLAG_E:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, E, temp);
			break;
		case TMS320_FLAG_R:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, R, temp);
			break;
		case TMS320_FLAG_U:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, U, temp);
			break;
		case TMS320_FLAG_u:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, u, temp);
			break;
		case TMS320_FLAG_g:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, g, temp);
			break;
		case TMS320_FLAG_r:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, r, temp);
			break;
		case TMS320_FLAG_t:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, t, temp);
			break;

		case TMS320_FLAG_k3:
			temp = get_bits (dasm->opcode64, flag->f, 3);
			set_field_value (dasm, k3, temp);
			break;
		case TMS320_FLAG_k4:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, k4, temp);
			break;
		case TMS320_FLAG_k5:
			temp = get_bits (dasm->opcode64, flag->f, 5);
			set_field_value (dasm, k5, temp);
			break;
		case TMS320_FLAG_k6:
			temp = get_bits (dasm->opcode64, flag->f, 6);
			set_field_value (dasm, k6, temp);
			break;
		case TMS320_FLAG_k8:
			temp = get_bits (dasm->opcode64, flag->f, 8);
			set_field_value (dasm, k8, temp);
			break;
		case TMS320_FLAG_k12:
			temp = get_bits (dasm->opcode64, flag->f, 12);
			set_field_value (dasm, k12, temp);
			break;
		case TMS320_FLAG_k16:
			temp = get_bits (dasm->opcode64, flag->f, 16);
			set_field_value (dasm, k16, temp);
			break;

		case TMS320_FLAG_l1:
			temp = get_bits (dasm->opcode64, flag->f, 1);
			set_field_value (dasm, l1, temp);
			break;
		case TMS320_FLAG_l3:
			temp = get_bits (dasm->opcode64, flag->f, 3);
			set_field_value (dasm, l3, temp);
			break;
		case TMS320_FLAG_l7:
			temp = get_bits (dasm->opcode64, flag->f, 7);
			set_field_value (dasm, l7, temp);
			break;
		case TMS320_FLAG_l16:
			temp = get_bits (dasm->opcode64, flag->f, 16);
			set_field_value (dasm, l16, temp);
			break;

		case TMS320_FLAG_K8:
			temp = get_bits (dasm->opcode64, flag->f, 8);
			set_field_value (dasm, K8, temp);
			break;
		case TMS320_FLAG_K16:
			temp = get_bits (dasm->opcode64, flag->f, 16);
			set_field_value (dasm, K16, temp);
			break;

		case TMS320_FLAG_L7:
			temp = get_bits (dasm->opcode64, flag->f, 7);
			set_field_value (dasm, L7, temp);
			break;
		case TMS320_FLAG_L8:
			temp = get_bits (dasm->opcode64, flag->f, 8);
			set_field_value (dasm, L8, temp);
			break;
		case TMS320_FLAG_L16:
			temp = get_bits (dasm->opcode64, flag->f, 16);
			set_field_value (dasm, L16, temp);
			break;

		case TMS320_FLAG_P8:
			temp = get_bits (dasm->opcode64, flag->f, 8);
			set_field_value (dasm, P8, temp);
			break;
		case TMS320_FLAG_P24:
			temp = get_bits (dasm->opcode64, flag->f, 24);
			set_field_value (dasm, P24, temp);
			break;

		case TMS320_FLAG_D16:
			temp = get_bits (dasm->opcode64, flag->f, 16);
			set_field_value (dasm, D16, temp);
			break;

		case TMS320_FLAG_SHFT:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, SHFT, temp);
			break;
		case TMS320_FLAG_SHIFTW:
			temp = get_bits (dasm->opcode64, flag->f, 6);
			set_field_value (dasm, SHIFTW, temp);
			break;

		case TMS320_FLAG_CCCCCCC:
			temp = get_bits (dasm->opcode64, flag->f, 7);
			set_field_value (dasm, CCCCCCC, temp);
			break;
		case TMS320_FLAG_AAAAAAAI:
			temp = get_bits (dasm->opcode64, flag->f, 8);
			set_field_value (dasm, AAAAAAAI, temp);
			break;

		case TMS320_FLAG_uu:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			set_field_value (dasm, uu, temp);
			break;
		case TMS320_FLAG_cc:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			set_field_value (dasm, cc, temp);
			break;
		case TMS320_FLAG_ss:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			set_field_value (dasm, ss, temp);
			break;
		case TMS320_FLAG_dd:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			set_field_value (dasm, dd, temp);
			break;
		case TMS320_FLAG_mm:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			set_field_value (dasm, mm, temp);
			break;
		case TMS320_FLAG_vv:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			set_field_value (dasm, vv, temp);
			break;
		case TMS320_FLAG_tt:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			set_field_value (dasm, tt, temp);
			break;

		case TMS320_FLAG_XSSS:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, XSSS, temp);
			break;
		case TMS320_FLAG_XDDD:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, XDDD, temp);
			break;
		case TMS320_FLAG_FSSS:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, FSSS, temp);
			break;
		case TMS320_FLAG_FDDD:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, FDDD, temp);
			break;
		case TMS320_FLAG_XACS:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, XACS, temp);
			break;
		case TMS320_FLAG_XACD:
			temp = get_bits (dasm->opcode64, flag->f, 4);
			set_field_value (dasm, XACD, temp);
			break;

		case TMS320_FLAG_SS:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			if (!field_valid (dasm, SS)) {
				set_field_value (dasm, SS, temp);
			} else {
				set_field_value (dasm, SS2, temp);
			}
			break;
		case TMS320_FLAG_DD:
			temp = get_bits (dasm->opcode64, flag->f, 2);
			if (!field_valid (dasm, DD)) {
				set_field_value (dasm, DD, temp);
			} else {
				set_field_value (dasm, DD2, temp);
			}
			break;

