radareorg/radare2/libr/arch/p/tms320/tms320_dasm.c
		case TMS320_FLAG_XXX:
			temp = get_bits (dasm->opcode64, flag->f, 3);
			set_field_value (dasm, Xmem_reg, temp);
			break;
		case TMS320_FLAG_MMM:
			temp = get_bits (dasm->opcode64, flag->f, 3);
			if (!field_valid (dasm, Xmem_mmm)) {
				set_field_value (dasm, Xmem_mmm, temp);
			} else {
				set_field_value (dasm, Ymem_mmm, temp);
			}
			break;
		case TMS320_FLAG_Y:
			temp = get_bits (dasm->opcode64, flag->f, 1) << 0;
			if (!field_valid (dasm, Ymem_reg)) {
				set_field_value (dasm, Ymem_reg, temp);
			} else {
				field_value (dasm, Ymem_reg) |= temp;
			}
			break;
		case TMS320_FLAG_YY:
			temp = get_bits (dasm->opcode64, flag->f, 2) << 1;
			if (!field_valid (dasm, Ymem_reg)) {
				set_field_value (dasm, Ymem_reg, temp);
			} else {
				field_value (dasm, Ymem_reg) |= temp;
			}
			break;

		default:
			printf ("TODO: unknown opcode flag %02x\n", flag->v);
			return 0;
		}
	}

	return 1;
}

int run_m_list(tms320_dasm_t *dasm) {
	insn_mask_t *mask;

	if (!dasm->insn->m_list) {
		return 1;
	}

	for (mask = dasm->insn->m_list; !m_list_last (mask); mask++) {
		/* match bits in range [f, f + n] with mask's value */
		if (get_bits (dasm->opcode64, mask->f, mask->n) != mask->v) {
			return 0;
		}
	}

	return 1;
}

int vreplace(char *string, const char *token, const char *fmt, va_list args) {
	char data[64];
	char *pos;

	pos = strstr (string, token);
	if (!pos) {
		return 0;
	}

	vsnprintf (data, sizeof (data), fmt, args);

	memmove (pos + strlen (data), pos + strlen (token), strlen (pos + strlen (token)) + 1);
	memmove (pos, data, strlen (data));

	return 1;
}

int replace(char *string, const char *token, const char *fmt, ...) {
	int result;
	va_list args;

	va_start (args, fmt);
	result = vreplace (string, token, fmt, args);
	va_end (args);

	return result;
}

void substitute(char *string, const char *token, const char *fmt, ...) {
	int result;
	va_list args;

	do {
		va_start (args, fmt);
		result = vreplace (string, token, fmt, args);
		va_end (args);
	} while (result);
}

const char *get_xreg_str(ut8 key, char *str) {
	static const char *table[16] = {
		"ac0",
		"ac1",
		"ac2",
		"ac3",
		"xsp",
		"xssp",
		"xdp",
		"xcdp",
		"xar0",
		"xar1",
		"xar2",
		"xar3",
		"xar4",
		"xar5",
		"xar6",
		"xar7",
	};

	return table[key & 15];
}

const char *get_freg_str(ut8 key, char *str) {
	static const char *table[16] = {
		"ac0",
		"ac1",
		"ac2",
		"ac3",
		"t0",
		"t1",
		"t2",
		"t3",
		"ar0",
		"ar1",
		"ar2",
		"ar3",
		"ar4",
		"ar5",
		"ar6",
		"ar7",
	};

	return table[key & 15];
}

const char *get_swap_str(ut8 key, char *str) {
	switch (key) {
	case 0: return "swap ac0, ac2";
	case 1: return "swap ac1, ac3";
	case 4: return "swap t0, t2";
	case 5: return "swap t1, t3";
	case 8: return "swap ar0, ar2";
	case 9: return "swap ar1, ar3";
	case 12: return "swap ar4, t0";
	case 13: return "swap ar5, t1";
	case 14: return "swap ar6, t2";
	case 15: return "swap ar7, t3";
	case 16: return "swapp ac0, ac2";
	case 20: return "swapp t0, t2";
	case 24: return "swapp ar0, ar2";
	case 28: return "swapp ar4, t0";
	case 30: return "swapp ar6, t2";
	case 44: return "swap4 ar4, t0";
	case 56: return "swap ar0, ar1";
	}

	return "invalid";
}

const char *get_relop_str(ut8 key, char *str) {
	static const char *table[] = {
		"==", "<", ">=", "!="
	};

	return table[key & 3];
}

const char *get_cond_str(ut8 key, char *str) {
	/* 000 FSSS ... 101 FSSS */
	if ((key >> 4) <= 5) {
		static const char *op[6] = { "==", "!=", "<", "<=", ">", ">=" };
		sprintf (str, "%s %s 0", get_freg_str (key & 15, NULL), op[(key >> 4) & 7]);
		return str;
	}

	/* 110 00SS */
	if ((key >> 2) == 0x18) {
		sprintf (str, "overflow(ac%d)", key & 3);
		return str;
	}

	/* 111 00SS */
	if ((key >> 2) == 0x1C) {
		sprintf (str, "!overflow(ac%d)", key & 3);
		return str;
	}

	switch (key) {
	case 0x64: return "tc1";
	case 0x65: return "tc2";
	case 0x66: return "carry";
	case 0x74: return "!tc1";
	case 0x75: return "!tc2";
	case 0x76:
		return "!carry";
		/* "&" operation */
	case 0x68: return "tc1 & tc2";
	case 0x69: return "tc1 & !tc2";
	case 0x6A: return "!tc1 & tc2";
	case 0x6B:
		return "!tc1 & !tc2";
		/* "|" operation */
	case 0x78: return "tc1 | tc2";
	case 0x79: return "tc1 | !tc2";
	case 0x7A: return "!tc1 | tc2";
	case 0x7B:
		return "!tc1 | !tc2";
		/* "^" operation */
	case 0x7C: return "tc1 ^ tc2";
	case 0x7D: return "tc1 ^ !tc2";
	case 0x7E: return "!tc1 ^ tc2";
	case 0x7F: return "!tc1 ^ !tc2";
	}

	return "invalid";
}

const char *get_v_str(ut8 key, char *str) {
	static const char *table[2] = {
		"carry",
		"tc2",
	};

	return table[key & 1];
}

const char *get_t_str(ut8 key, char *str) {
	static const char *table[2] = {
		"tc1",
		"tc2",
	};

	return table[key & 1];
}

const char *get_cmem_str(ut8 key, char *str) {
	static const char *table[4] = {
		"*cdp",
		"*cdp+",
		"*cdp-",
		"*(cdp+t0)",
	};

	return table[key & 3];
}

const char *get_smem_str(ut8 key, char *str) {
	// direct memory

	if ((key & 0x01) == 0) {
#ifdef IDA_COMPATIBLE_MODE
		sprintf (str, "*sp(#%Xh)", key >> 1);
#else
		sprintf (str, "@0x%02X", key >> 1);
#endif
		return str;
	}

	// indirect memory

	switch (key) {
	case 0x11: return "abs16(k16)";
	case 0x31: return "*(k23)";
	case 0x51: return "port(k16)";
	case 0x71: return "*cdp";
	case 0x91: return "*cdp+";
	case 0xB1: return "*cdp-";
	case 0xD1: return "*cdp(K16)";
	case 0xF1: return "*+cdp(K16)";
	}

	switch (key & 0x1F) {
	case 0x01: return "*ARn";
	case 0x03: return "*ARn+";
	case 0x05:
		return "*ARn-";
		// TODO:
		//	C54CM:0 => *(ARn + T0)
		//	C54CM:1 => *(ARn + AR0)
	case 0x07:
		return "*(ARn + t0)";
		// TODO:
		//	C54CM:0 => *(ARn - t0)
		//	C54CM:1 => *(ARn - AR0)
	case 0x09:
		return "*(ARn - t0)";
		// TODO:
		//	C54CM:0 => *ARn (t0)
		//	C54CM:1 => *ARn (AR0)
	case 0x0B: return "*ARn(t0)";
	case 0x0D: return "*ARn(k16)";
	case 0x0F:
		return "*+ARn(k16)";
		// TODO:
		//	ARMS:0 => *(ARn + T1)
		//	ARMS:1 => *ARn (short (1))
	case 0x13:
		return "*(ARn + t1)";
		// TODO:
		//	ARMS:0 => *(ARn - T1)
		//	ARMS:1 => *ARn (short (2))
	case 0x15:
		return "*(ARn - t1)";
		// TODO:
		//	ARMS:0 => *ARn (T1)
		//	ARMS:1 => *ARn (short (3))
	case 0x17:
		return "*ARn(t1)";
		// TODO:
		//	ARMS:0 => *+ARn
		//	ARMS:1 => *ARn (short (4))
	case 0x19:
		return "*+ARn";
		// TODO:
		//	ARMS:0 => *-ARn
		//	ARMS:1 => *ARn (short (5))
	case 0x1B:
		return "*-ARn";
		// TODO:
		//	ARMS:0 => *(ARn + t0b)
		//	ARMS:1 => *ARn (short (6))
	case 0x1D:
		return "*(ARn + t0b)";
		// TODO:
		//	ARMS:0 => *(arn - t0b)
		//	ARMS:1 => *arn (short (7))
	case 0x1F: return "*(ARn - t0b)";
	}

	return "invalid";
}

