radareorg/radare2/libr/arch/p/tms320/tms320_dasm.c
const char *get_mmm_str(ut8 key, char *str) {
	switch (key & 7) {
	default:
	case 0x00: return "*ARn";
	case 0x01: return "*ARn+";
	case 0x02:
		return "*ARn-";
		// TODO:
		//	C54CM:0 => *(ARn + T0)
		//	C54CM:1 => *(ARn + AR0)
	case 0x03: return "*(ARn + t0)";
	case 0x04:
		return "*(ARn + t1)";
		// TODO:
		//	C54CM:0 => *(ARn - t0)
		//	C54CM:1 => *(ARn - AR0)
	case 0x05: return "*(ARn - t0)";
	case 0x06:
		return "*(ARn - t1)";
		// TODO:
		//	C54CM:0 => *ARn (T0)
		//	C54CM:1 => *ARn (AR0)
	case 0x07: return "*ARn(t0)";
	};
}

/*
 * syntax decoders
 */

void decode_bits(tms320_dasm_t *dasm) {
	// rounding
	if (field_valid (dasm, R)) {
		substitute (dasm->syntax, "[r]", "%s", field_value (dasm, R)? "r": "");
	}

	// unsigned
	if (field_valid (dasm, u)) {
		substitute (dasm->syntax, "[u]", "%s", field_value (dasm, u)? "u": "");
	}

	// 40 keyword
	if (field_valid (dasm, g)) {
		substitute (dasm->syntax, "[40]", "%s", field_value (dasm, g)? "40": "");
	}

	// T3 update
	if (field_valid (dasm, U)) {
		substitute (dasm->syntax, "[T3 = ]", "%s", field_value (dasm, U)? "t3=": "");
	}
}

void decode_braces(tms320_dasm_t *dasm) {
	char *pos;

	pos = strstr (dasm->syntax, "[(saturate]");
	if (pos) {
		replace (pos, "[)", ")[");
		replace (dasm->syntax, "[(saturate]", "%s", "(saturate");
	}

	if (field_valid (dasm, R)) {
		pos = strstr (dasm->syntax, "[rnd(]");
		if (pos) {
			replace (pos, "[)", "%s", field_value (dasm, R)? ")[": "[");
			replace (dasm->syntax, "[rnd(]", "%s", field_value (dasm, R)? "rnd(": "");
		}
	}

	if (field_valid (dasm, u)) {
		pos = strstr (dasm->syntax, "[uns(]");
		if (pos) {
			replace (pos, "[)", "%s", field_value (dasm, u)? ")[": "[");
			replace (dasm->syntax, "[uns(]", "%s", field_value (dasm, u)? "uns(": "");
		}
	}

	if (field_valid (dasm, uu)) {
		bool parallel = !!strstr (dasm->syntax, "::");

		// first
		replace (dasm->syntax, "[uns(]", "%s", field_value (dasm, uu) & 2? "uns(": "");
		replace (dasm->syntax, "[)]", "%s", field_value (dasm, uu) & 2? ")": "");

		if (parallel) {
			replace (dasm->syntax, "[uns(]", "%s", field_value (dasm, uu) & 2? "uns(": "");
			replace (dasm->syntax, "[)]", "%s", field_value (dasm, uu) & 2? ")": "");
		}

		// second
		replace (dasm->syntax, "[uns(]", "%s", field_value (dasm, uu) & 1? "uns(": "");
		replace (dasm->syntax, "[)]", "%s", field_value (dasm, uu) & 1? ")": "");

		if (parallel) {
			replace (dasm->syntax, "[uns(]", "%s", field_value (dasm, uu) & 1? "uns(": "");
			replace (dasm->syntax, "[)]", "%s", field_value (dasm, uu) & 1? ")": "");
		}
	}

	// remove rudiments

	substitute (dasm->syntax, "[]", "%s", "");
}

void decode_constants(tms320_dasm_t *dasm) {
	// signed constant

	if (field_valid (dasm, K8)) {
		substitute (dasm->syntax, "K8", "0x%02X", field_value (dasm, K8));
	}
	if (field_valid (dasm, K16)) {
		substitute (dasm->syntax, "K16", "0x%04X", be16 (field_value (dasm, K16)));
	}

	// unsigned constant

	if (field_valid (dasm, k4)) {
		substitute (dasm->syntax, "K4", "0x%01X", field_value (dasm, k4));
	}
	if (field_valid (dasm, k5)) {
		substitute (dasm->syntax, "k5", "0x%02X", field_value (dasm, k5));
	}
	if (field_valid (dasm, k8)) {
		substitute (dasm->syntax, "k8", "0x%02X", field_value (dasm, k8));
	}

	if (field_valid (dasm, k12)) {
		substitute (dasm->syntax, "k12", "0x%03X", be16 (field_value (dasm, k12)));
	}
	if (field_valid (dasm, k16)) {
		substitute (dasm->syntax, "k16", "0x%04X", be16 (field_value (dasm, k16)));
	}

	if (field_valid (dasm, k4) && field_valid (dasm, k3)) {
		substitute (dasm->syntax, "k7", "0x%02X", (field_value (dasm, k3) << 4) | field_value (dasm, k4));
	}
	if (field_valid (dasm, k4) && field_valid (dasm, k5)) {
		substitute (dasm->syntax, "k9", "0x%03X", (field_value (dasm, k5) << 4) | field_value (dasm, k4));
	}
	if (field_valid (dasm, k4) && field_valid (dasm, k8)) {
		substitute (dasm->syntax, "k12", "0x%03X", (field_value (dasm, k8) << 4) | field_value (dasm, k4));
	}

	// dasm address label

	if (field_valid (dasm, D16)) {
		substitute (dasm->syntax, "D16", "0x%04X", be16 (field_value (dasm, D16)));
	}

	// immediate shift value

	if (field_valid (dasm, SHFT)) {
		substitute (dasm->syntax, "#SHFT", "0x%01X", field_value (dasm, SHFT));
	}
	if (field_valid (dasm, SHIFTW)) {
		substitute (dasm->syntax, "#SHIFTW", "0x%02X", field_value (dasm, SHIFTW));
	}
}

void decode_addresses(tms320_dasm_t *dasm) {
	// program address label

	if (field_valid (dasm, L7)) {
		substitute (dasm->syntax, "L7", "0x%02X", field_value (dasm, L7));
	}
	if (field_valid (dasm, L8)) {
		substitute (dasm->syntax, "L8", "0x%02X", field_value (dasm, L8));
	}
	if (field_valid (dasm, L16)) {
		substitute (dasm->syntax, "L16", "0x%04X", be16 (field_value (dasm, L16)));
	}

	// program address label

	if (field_valid (dasm, l1) && field_valid (dasm, l3)) {
		substitute (dasm->syntax, "l4", "0x%01X", (field_value (dasm, l3) << 1) | field_value (dasm, l1));
	}

	// program memory address

	if (field_valid (dasm, l7)) {
		substitute (dasm->syntax, "pmad", "0x%02X", field_value (dasm, l7));
	}
	if (field_valid (dasm, l16)) {
		substitute (dasm->syntax, "pmad", "0x%04X", be16 (field_value (dasm, l16)));
	}

	// program or dasm address label

	if (field_valid (dasm, P8)) {
		substitute (dasm->syntax, "P8", "0x%02X", field_value (dasm, P8));
	}
	if (field_valid (dasm, P24)) {
		substitute (dasm->syntax, "P24", "0x%06X", be24 (field_value (dasm, P24)));
	}
}

void decode_swap(tms320_dasm_t *dasm) {
	char tmp[64];

	if (field_valid (dasm, k6)) {
		substitute (dasm->syntax, "SWAP ( )", get_swap_str (field_value (dasm, k6), tmp));
	}
}

void decode_relop(tms320_dasm_t *dasm) {
	if (field_valid (dasm, cc)) {
		substitute (dasm->syntax, "RELOP", get_relop_str (field_value (dasm, cc), NULL));
	}
}

void decode_cond(tms320_dasm_t *dasm) {
	char tmp[64];

	if (field_valid (dasm, CCCCCCC)) {
		substitute (dasm->syntax, "cond", "%s", get_cond_str (field_value (dasm, CCCCCCC), tmp));
	}

	substitute (dasm->syntax, "[label, ]", "");
}

void decode_registers(tms320_dasm_t *dasm) {
	ut8 code = 0;

