radareorg/radare2/libr/arch/p/tms320/tms320_dasm.c
	// transition register

	if (field_valid (dasm, r)) {
		substitute (dasm->syntax, "TRNx", "trn%d", field_value (dasm, r));
	}

	// source and destination temporary registers

	if (field_valid (dasm, ss)) {
		substitute (dasm->syntax, "Tx", "t%d", field_value (dasm, ss));
	}

	if (field_valid (dasm, dd)) {
		substitute (dasm->syntax, "Tx", "t%d", field_value (dasm, dd));
	}

	// shifted in/out bit values

	if (field_valid (dasm, vv)) {
		substitute (dasm->syntax, "BitIn", "%s", get_v_str (field_value (dasm, vv) >> 1, NULL));
		substitute (dasm->syntax, "BitOut", "%s", get_v_str (field_value (dasm, vv) >> 0, NULL));
	}

	// source and destination of CRC instruction

	if (field_valid (dasm, t)) {
		substitute (dasm->syntax, "TCx", "%s", get_t_str (field_value (dasm, t), NULL));
	}

	if (field_valid (dasm, tt)) {
		substitute (dasm->syntax, "TCx", "%s", get_t_str (field_value (dasm, tt) >> 0, NULL));
		substitute (dasm->syntax, "TCy", "%s", get_t_str (field_value (dasm, tt) >> 1, NULL));
	}

	// source or destination accumulator or extended register

	if (field_valid (dasm, XSSS)) {
		substitute (dasm->syntax, "xsrc", "%s", get_xreg_str (field_value (dasm, XSSS), NULL));
		substitute (dasm->syntax, "XAsrc", "%s", get_xreg_str (field_value (dasm, XSSS), NULL));
	}

	if (field_valid (dasm, XDDD)) {
		substitute (dasm->syntax, "xdst", "%s", get_xreg_str (field_value (dasm, XDDD), NULL));
		substitute (dasm->syntax, "XAdst", "%s", get_xreg_str (field_value (dasm, XDDD), NULL));
	}

	// source or destination accumulator, auxiliary or temporary register

	if (field_valid (dasm, FSSS) && field_valid (dasm, FDDD)) {
		if (field_value (dasm, FSSS) == field_value (dasm, FDDD)) {
			substitute (dasm->syntax, "[src,] dst", "dst");
		} else {
			substitute (dasm->syntax, "[src,] dst", "src, dst");
		}
	}

	if (field_valid (dasm, FSSS) && field_valid (dasm, FDDD)) {
		substitute (dasm->syntax, "src1", "%s", get_freg_str (field_value (dasm, FSSS), NULL));
		substitute (dasm->syntax, "src2", "%s", get_freg_str (field_value (dasm, FDDD), NULL));

		substitute (dasm->syntax, "dst1", "%s", get_freg_str (field_value (dasm, FSSS), NULL));
		substitute (dasm->syntax, "dst2", "%s", get_freg_str (field_value (dasm, FDDD), NULL));
	}

	code &= 0;
	code |= field_valid (dasm, FSSS)? 0x01: 0x00;
	code |= field_valid (dasm, FDDD)? 0x02: 0x00;

	switch (code) {
	case 0x01: // FSSS
		substitute (dasm->syntax, "TAx", "%s", get_freg_str (field_value (dasm, FSSS), NULL));
		break;
	case 0x02: //      FDDD
		substitute (dasm->syntax, "TAx", "%s", get_freg_str (field_value (dasm, FDDD), NULL));
		substitute (dasm->syntax, "TAy", "%s", get_freg_str (field_value (dasm, FDDD), NULL));
		break;
	case 0x03: // FSSS FDDD
		substitute (dasm->syntax, "TAx", "%s", get_freg_str (field_value (dasm, FSSS), NULL));
		substitute (dasm->syntax, "TAy", "%s", get_freg_str (field_value (dasm, FDDD), NULL));
		break;
	}

	if (field_valid (dasm, FSSS)) {
		substitute (dasm->syntax, "src", "%s", get_freg_str (field_value (dasm, FSSS), NULL));
	}

	if (field_valid (dasm, FDDD)) {
		substitute (dasm->syntax, "dst", "%s", get_freg_str (field_value (dasm, FDDD), NULL));
	}

	if (field_valid (dasm, XACS)) {
		substitute (dasm->syntax, "XACsrc", "%s", get_xreg_str (field_value (dasm, XACS), NULL));
	}

	if (field_valid (dasm, XACD)) {
		substitute (dasm->syntax, "XACdst", "%s", get_xreg_str (field_value (dasm, XACD), NULL));
	}

	// source and destination accumulator registers

	code &= 0;
	code |= field_valid (dasm, SS)? 0x01: 0x00;
	code |= field_valid (dasm, SS2)? 0x02: 0x00;
	code |= field_valid (dasm, DD)? 0x10: 0x00;
	code |= field_valid (dasm, DD2)? 0x20: 0x00;

	switch (code) {
	case 0x01: // SS
		substitute (dasm->syntax, "ACx", "ac%d", field_value (dasm, SS));
		break;
	case 0x03: // SSSS
		substitute (dasm->syntax, "ACx", "ac%d", field_value (dasm, SS));
		substitute (dasm->syntax, "ACy", "ac%d", field_value (dasm, SS2));
		break;
	case 0x11: // SS   DD
		if (field_value (dasm, SS) == field_value (dasm, DD)) {
			substitute (dasm->syntax, "[, ACy]", "");
			substitute (dasm->syntax, "[ACx,] ACy", "ACy");
		} else {
			substitute (dasm->syntax, "[, ACy]", ", ACy");
			substitute (dasm->syntax, "[ACx,] ACy", "ACx, ACy");
		}
		substitute (dasm->syntax, "ACx", "ac%d", field_value (dasm, SS));
		substitute (dasm->syntax, "ACy", "ac%d", field_value (dasm, DD));
		break;
	case 0x33: // SSSS DDDD
		substitute (dasm->syntax, "ACx", "ac%d", field_value (dasm, SS));
		substitute (dasm->syntax, "ACy", "ac%d", field_value (dasm, SS2));
		substitute (dasm->syntax, "ACz", "ac%d", field_value (dasm, DD));
		substitute (dasm->syntax, "ACw", "ac%d", field_value (dasm, DD2));
		break;
	case 0x10: //      DD
		substitute (dasm->syntax, "ACx", "ac%d", field_value (dasm, DD));
		break;
	case 0x30: //      DDDD
		substitute (dasm->syntax, "ACx", "ac%d", field_value (dasm, DD));
		substitute (dasm->syntax, "ACy", "ac%d", field_value (dasm, DD2));
		break;
	}
}

void decode_addressing_modes(tms320_dasm_t *dasm) {
	// Cmem

	if (field_valid (dasm, mm)) {
		substitute (dasm->syntax, "Cmem", "%s", get_cmem_str (field_value (dasm, mm), NULL));
	}

	// Xmem and Ymem

	if (field_valid (dasm, Xmem_reg) && field_valid (dasm, Xmem_mmm)) {
		substitute (dasm->syntax, "Xmem", "%s", get_mmm_str (field_value (dasm, Xmem_mmm), NULL));
		substitute (dasm->syntax, "ARn", "ar%d", field_value (dasm, Xmem_reg));
	}

	if (field_valid (dasm, Ymem_reg) && field_valid (dasm, Ymem_mmm)) {
		substitute (dasm->syntax, "Ymem", "%s", get_mmm_str (field_value (dasm, Ymem_mmm), NULL));
		substitute (dasm->syntax, "ARn", "ar%d", field_value (dasm, Ymem_reg));
	}

	// Lmem and Smem

	if (field_valid (dasm, AAAAAAAI)) {
		char str[64], tmp[64];

		snprintf (tmp, sizeof (tmp), "%s", get_smem_str (field_value (dasm, AAAAAAAI), str));

		if (field_value (dasm, AAAAAAAI) & 1) {
			if (strstr (tmp, "k16")) {
				substitute (tmp, "k16", "0x%04X", r_read_be16 (dasm->stream + dasm->length));
				dasm->length += 2;
			} else if (strstr (tmp, "k23")) {
				substitute (tmp, "k23", "0x%06X", be24 (r_read_le32 (dasm->stream + dasm->length) & 0x7FFFFF));
				dasm->length += 3;
			} else if (strstr (tmp, "K16")) {
				substitute (tmp, "K16", "0x%04X", r_read_be16 (dasm->stream + dasm->length));
				dasm->length += 2;
			}

