radareorg/radare2/libr/arch/p/tms320/tms320_dasm.c
			substitute (tmp, "ARn", "ar%d", field_value (dasm, AAAAAAAI) >> 5);
		}

		substitute (dasm->syntax, "Smem", "%s", tmp);
		substitute (dasm->syntax, "Lmem", "%s", tmp);
	}
}

void decode_qualifiers(tms320_dasm_t *dasm) {
	switch (dasm->stream[dasm->length]) {
	case 0x98:
		// 1001 1000 - mmap
		break;

	case 0x99:
		// 1001 1001 - port (Smem)
		break;
	case 0x9a:
		// 1001 1010 - port (Smem)
		break;

	case 0x9c:
		// 1001 1100 - <insn>.LR
		set_field_value (dasm, q_lr, 1);
		break;
	case 0x9d:
		// 1001 1101 - <insn>.CR
		set_field_value (dasm, q_cr, 1);
		break;
	}
}

static insn_item_t *finalize(tms320_dasm_t *dasm) {
	// remove odd spaces

	substitute (dasm->syntax, "  ", "%s", " ");

	// add some qualifiers

	if (field_value (dasm, q_lr)) {
		replace (dasm->syntax, " ", ".lr ");
	}
	if (field_value (dasm, q_cr)) {
		replace (dasm->syntax, " ", ".cr ");
	}

	return dasm->insn;
}

insn_item_t *decode_insn(tms320_dasm_t *dasm) {
	dasm->length = dasm->head->size;

	snprintf (dasm->syntax, sizeof (dasm->syntax),
		field_valid (dasm, E) && field_value (dasm, E)? "|| %s": "%s", dasm->insn->syntax);

	decode_bits (dasm);
	decode_braces (dasm);
	decode_qualifiers (dasm);

	decode_constants (dasm);
	decode_addresses (dasm);

	decode_swap (dasm);
	decode_relop (dasm);
	decode_cond (dasm);

	decode_registers (dasm);
	decode_addressing_modes (dasm);

	return finalize (dasm);
}

insn_item_t *decode_insn_head(tms320_dasm_t *dasm) {
	run_f_list (dasm);

	if (dasm->insn->i_list) {
		dasm->insn = dasm->insn->i_list;
		while (!i_list_last (dasm->insn)) {
			if (run_m_list (dasm) && run_f_list (dasm)) {
				break;
			}
			dasm->insn++;
		}
	}

	if (!i_list_last (dasm->insn)) {
		return decode_insn (dasm);
	}

	return NULL;
}

static ut8 c55x_e_list[] = {
	0xF8,
	0x60, /* 0110 0lll */
	0xF0,
	0xA0, /* 1010 FDDD */
	0xFC,
	0xB0, /* 1011 00DD */
	0xF0,
	0xC0, /* 1100 FSSS */
	0xFC,
	0xBC, /* 1011 11SS */
	0x00,
	0x00,
};

insn_head_t *lookup_insn_head(tms320_dasm_t *dasm) {
	ut8 *e_list = NULL;
	/* handle some exceptions */

	if (tms320_f_get_cpu (dasm) == TMS320_F_CPU_C55X) {
		e_list = c55x_e_list;
	}
	while (e_list && (e_list[0] && e_list[1])) {
		if ((dasm->opcode & e_list[0]) == e_list[1]) {
			dasm->head = ht_up_find (dasm->map, e_list[1], NULL);
			break;
		}
		e_list += 2;
	}
	if (!dasm->head) {
		dasm->head = ht_up_find (dasm->map, dasm->opcode, NULL);
		if (!dasm->head) {
			dasm->head = ht_up_find (dasm->map, (dasm->opcode & 0xfe), NULL);
		}
	}
	dasm->insn = dasm->head? &dasm->head->insn: NULL;
	return dasm->head;
}

static void init_dasm(tms320_dasm_t *dasm, const ut8 *stream, int len) {
	strcpy (dasm->syntax, "invalid");
	memset (dasm->stream, 0, sizeof (dasm->stream));
	memcpy (dasm->stream, stream, R_MIN (sizeof (dasm->stream), len));
	dasm->status = 0;
	dasm->length = 0;
	memset (&dasm->f, 0, sizeof (dasm->f));
	dasm->opcode64 = (tms320_f_get_cpu (dasm) == TMS320_F_CPU_C64X)? r_read_be64 (dasm->stream): r_read_le64 (dasm->stream);
	dasm->head = NULL;
	dasm->insn = NULL;
}

static int full_insn_size(tms320_dasm_t *dasm) {
	int qualifier_size = 0;
	if (field_value (dasm, q_cr)) {
		qualifier_size = 1;
	}
	if (field_value (dasm, q_lr)) {
		qualifier_size = 1;
	}
	return dasm->length + qualifier_size;
}

/*
 * TMS320 disassembly engine public interface
 */

int tms320_dasm(tms320_dasm_t *dasm, const ut8 *stream, int len) {
	init_dasm (dasm, stream, len);

	if (tms320_f_get_cpu (dasm) != TMS320_F_CPU_C55X_PLUS) {
		if (lookup_insn_head (dasm) && decode_insn_head (dasm)) {
			if (dasm->length > len) {
				dasm->status |= TMS320_S_INVAL;
			}
		}
	} else {
		c55x_plus_disassemble (dasm, stream, len);
	}

	if (strstr (dasm->syntax, "invalid")) {
		dasm->status |= TMS320_S_INVAL;
	}

	if (dasm->status & TMS320_S_INVAL) {
		strcpy (dasm->syntax, "invalid"), dasm->length = 1;
	}

	return full_insn_size (dasm);
}

// insn_head_t c55x_list[]
#include "c55x/table.h"

bool tms320_dasm_init(tms320_dasm_t *dasm) {
	int i = 0;

	if (dasm->map) {
		/* already initialized */
		return false;
	}

	dasm->map = ht_up_new0 ();
	if (!dasm->map) {
		return false;
	}
	for (i = 0; i < R_ARRAY_SIZE (c55x_list); i++) {
		ht_up_insert (dasm->map, c55x_list[i].byte, &c55x_list[i]);
	}
	tms320_f_set_cpu (dasm, TMS320_F_CPU_C55X);
	return true;
}

int tms320_dasm_fini(tms320_dasm_t *dasm) {
	if (dasm) {
		if (dasm->map) {
			ht_up_free (dasm->map);
		}
		/* avoid double free */
		memset (dasm, 0, sizeof (tms320_dasm_t));
	}
	return 0;
}
